<template>
	<view class="ux-flex ux-align-items-start ux-bg-primary ux-padding">
		<view style="border-radius:50%;" hover-class="ux-tap" @click="back">
			<uni-icons class="va" color="white" type="arrow-left" size="25"></uni-icons>
		</view>
		&nbsp;&nbsp;
		<text class="ux-h4 ux-color-white va">用户协议</text>
	</view>
  <view style="margin: 20rpx;" class="hm">
    <text>
      <p>欢迎使用 <strong>RailGo</strong>（以下简称“本软件”）！为保障您的合法权益，在您使用本软件前，请仔细阅读并同意以下条款：</p>

      <br>

      <h3>一、本软件声明</h3>
      <p>本软件非官方软件，与中国国家铁路集团总公司、中国铁道科学研究院集团有限公司等铁路运营企业及其下级企业单位无任何隶属关系。</p>

      <br><br>

      <h3>二、数据声明</h3>
      <p>本软件系为相关人士提供信息收集与整理的软件，提供的所有数据均为计算机采集获得，仅供学习参考，不保证实时性、准确性或完整性。用户应自行核对信息并选择采信。</p>

      <br><br>

      <h3>三、软件使用限制</h3>
      <p>本软件系开放源代码软件，对用户的修改与使用无任何管辖和控制力。因依赖本软件数据所产生的一切纠纷、事件（包括但不限于误车、错乘等）及后果，由用户个人承担，软件开发组不负连带责任。</p>

      <br><br>

      <h3>四、数据来源及隐私保护</h3>
      <p>本软件所采集数据均来自合法公开的官方渠道，不涉及任何涉密或未公开内容。开发组已尽力对敏感信息进行消除，但因上述数据来源工作疏忽，导致信息错误或涉密信息被刊载上网，经由本软件传播的，本软件开发组不负连带责任。</p>

      <br><br>

      <h3>五、禁止行为</h3>
      <p>禁止将本软件提供的数据、代码或衍生内容用于以下用途：</p>
      <ul>
        <li>从事违反中华人民共和国法律法规，违背公序良俗的行为。</li>
        <li>从事损害他人合法权利，损害任何主体名誉的行为。</li>
        <li>意图利用或引用本软件信息，分析涉密或未公开的关键交通基础设施信息。</li>
        <li>要求铁路营运企业以本软件所刊载信息数据为准进行任何形式的服务，无理取闹，扰乱铁路运营秩序。</li>
        <li>将数据、软件及上述两者的修改品用于商业盈利用途，包括但不限于售卖、广告、增值服务等。</li>
        <li>在不标明来源的情况下，转载本软件所载数据或作软件修改。</li>
        <li>法律法规规定的其他情况。</li>
      </ul>

      <br><br>

      <h3>六、服务稳定性</h3>
      <p>本软件为公益软件，无法对服务稳定性做出保证。本软件可能因政策、技术或不可抗力因素随时调整或终止服务，开发组将尽义务提供有关信息。</p>

      <br><br>

      <h3>七、协议解释权</h3>
      <p>开发者保留对本协议的最终解释权及修改权，更新后的协议自发布即生效。开发组有义务及时明确公布修改后的条款。</p>

      <br><br>

      <p>继续使用本软件即视为您已阅读并同意上述条款。</p>

      <br><br>

      <p style="text-align: right;"><strong>北京学汇智创文化发展有限公司</strong></p>
		<br><br>
      <h3>附：关于本软件数据采集来源</h3>

      <br><br>

      <h4>一、离线数据</h4>
      <p>本软件主要查询功能依赖由 RailGo 服务器预先生成的数据表格，由 RailGo 服务器从以下来源获取对应数据：</p>
      <ul>
        <li>铁路 12306 网站、小程序及APP（客运车站电报码、拼音码等），中国铁道科学研究院集团有限公司。</li>
        <li>铁路 95306 网站（货运车站电报码等），中国铁道科学研究院集团有限公司。</li>
        <li>昆铁货运网站（货运车站电报码等），中国铁路昆明局集团有限公司信息技术所。</li>
        <li>国铁吉讯小程序（车次走行里程信息），北京国铁吉讯科技有限公司。</li>
      </ul>
      <p>此外，第三方收集的数据版权归其收集数据的贡献者共同所有：</p>
      <ul>
        <li>Passearch（车辆和动车组归属信息）</li>
        <li>Openstreetmap（铁路线路地图信息）</li>
      </ul>

      <br><br>

      <h4>二、在线数据</h4>
      <p>在一些情况下，RailGo 客户端可能会通过发出互联网请求的方式，从以下来源即时获取数据：</p>
      <ul>
        <li>铁路 12306 网站、小程序及APP（客运车站大屏、车次正晚点等），中国铁道科学研究院集团有限公司。</li>
        <li>国铁吉讯小程序（客运车站大屏），北京国铁吉讯科技有限公司。</li>
      </ul>

      <br><br>

      <h4>三、数据使用注意事项</h4>
      <p>获取以上数据时，RailGo 服务器及客户端均遵循来源主体及服务器对数据采集的限制措施，遵循法律法规及数据来源对应的使用协议。</p>

      <br><br>

      <h4>四、涉关键基础设施数据保密处理事项</h4>
      <p>本软件所采集的数据均从合法公开的渠道以正当手段获取，不涉及涉密信息的存储与处理。开发组已尽力预防并自动删除敏感内容。</p>
    </text>
  </view>
  <br>
</template>

<script>
	export default {
		data() {
			return {
				"keyword": "",
				"future": true
			}
		},
		methods: {
			back: function() {
				uni.navigateBack()
			}
		}
	}
</script>
