export const TRAIN_KIND_COLOR_MAP = {
	"": "#a9dfbf", // 普慢
	"1": "#a9dfbf", // 普慢
	"2": "#a9dfbf", // 普慢
	"3": "#a9dfbf", // 普慢
	"4": "#a9dfbf", // 普慢
	"5": "#a9dfbf", // 普慢
	"6": "#a9dfbf", // 普慢
	"7": "#a9dfbf", // 普慢
	"8": "#a9dfbf", // 普慢
	"K": "#eeba67", // 快速
	"T": "#459811", // 特快
	"Z": "#114598", // 直特
	"G": "#c0392b", // 高动
	"D": "#5499c7", // 动车+城际
	"C": "#2e9f9c",
	"S": "#8e44ad", // 市域
	"L": "#a9dfbf", // 临客
	"Y": "#eeba67" // 旅游
};

export const CAR_PERFORMANCE = {
	"CRH1A": ["8", "5M3T", "4/5车 有座"],
	"CRH1B": ["16", "10M6T", "9车 有座"],
	"CRH1E": ["16", "10M6T", "9车 有座(旧)/无座(统)"],
	"CRH1A-A": ["8", "5M3T", "5车 无座"],
	"CRH2A": ["8", "4M4T", '5车 有座(旧)/无座(统)'],
	"CRH2B": ["16", "8M8T", "8车 有座"],
	"CRH2C": ["8", "6M2T", "5车 有座"],
	"CRH2E": ["16", "8M8T", "8/9车 有座"],
	"CRH2G": ["8", "4M4T", "5车 无座"],
	"CRH3A": ["8", "4M4T", "5车 无座"],
	"CRH3C": ["8", "4M4T", "4车 有座"],
	"CRH3A-A": ["4", "2M2T", "不设餐车"],
	"CRH5A": ["8", "5M3T", "6车 无座"],
	"CRH5G": ["8", "5M3T", "5车 无座"],
	"CRH6A": ["8", "4M4T", "不设餐车"],
	"CRH6A-A": ["4", "2M2T", "不设餐车"],
	"CRH6F": ["8", "4M4T", "不设餐车"],
	"CRH6F-A": ["4", "2M2T", "不设餐车"],
	"CRH380A": ["8", "6M2T", "5车 有座(旧)/无座(统)"],
	"CRH380AL": ["16", "14M2T", "9车 有座"],
	"CRH380AN": ["8", "4M4T", "5车 有座"],
	"CRH380B": ["8", "4M4T", "5车 无座"],
	"CRH380BL": ["16", "8M8T", "9车 有座"],
	"CRH380BG": ["8", "4M4T", "5车 无座"],
	"CRH380CL": ["16", "8M8T", "9车 有座"],
	"CRH380D": ["8", "4M4T", "5车 有座(旧)/无座(统)"],
	"CR400AF": ["8", "4M4T", "5车 无座"],
	"CR400AF-A": ["16", "8M8T", "9车 无座"],
	"CR400AF-AE": ["16", "8M8T", "8车 无座"],
	"CR400AF-B": ["17", "8M9T", "9车 无座"],
	"CR400AF-C": ["8", "4M4T", "5车 无座"],
	"CR400AF-G": ["8", "4M4T", "5车 无座"],
	"CR400AF-Z": ["8", "4M4T", "5车 无座"],
	"CR400AF-AZ": ["16", "8M8T", "9车 无座"],
	"CR400AF-BZ": ["17", "8M9T", "9车 无座"],
	"CR400AF-S": ["8", "4M4T", "5车 无座"],
	"CR400AF-BS": ["17", "8M9T", "9车 无座"],
	"CR400BF": ["8", "4M4T", "5车 无座"],
	"CR400BF-A": ["16", "8M8T", "9车 无座"],
	"CR400BF-B": ["17", "8M9T", "9车 无座"],
	"CR400BF-G": ["8", "4M4T", "5车 无座"],
	"CR400BF-C": ["8", "4M4T", "5车 无座"],
	"CR400BF-Z": ["8", "4M4T", "5车 无座"],
	"CR400BF-AZ": ["16", "8M8T", "9车 无座"],
	"CR400BF-BZ": ["17", "8M9T", "9车 无座"],
	"CR400BF-GZ": ["8", "4M4T", "5车 无座"],
	"CR400BF-S": ["8", "4M4T", "5车 无座"],
	"CR400BF-AS": ["16", "8M8T", "9车 无座"],
	"CR400BF-BS": ["17", "8M9T", "9车 无座"],
	"CR400BF-GS": ["8", "4M4T", "5车 无座"],
	"CR300AF": ["8", "4M4T", "5车 无座"],
	"CR300BF": ["8", "4M4T", "5车 无座"],
	"CR200J1-A": ["9/18", "1M8T/2M16T", "4/9车 无座"],
	"CR200J2-A": ["9/18", "1M8T/2M16T", "4/9车 无座"],
	"CR200J3-A": ["9/18", "1M8T/2M16T", "4/9车 无座"],
	"CR200J1-B": ["9", "1M8T", "4车 无座"],
	"CR200J2-B": ["9", "1M8T", "4车 无座"],
	"CR200J3-B": ["9", "1M8T", "4车 无座"],
	"CR200JS-G": ["12", "3M9T", "4车 无座"],
	"CR200J1-C": ["9/18", "1M8T/2M16T", "4/9车 无座"],
	"CR200J1-D": ["9", "1M8T", "4车 无座"],
	"CR200J3-C": ["9/18", "1M8T/2M16T", "4/9车 无座"]
}